Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Added information about the @autoclosure attribute—including its @autoclosure(escaping) form—to the Autoclosures section.
ja: @autoclosure属性についての情報を ― それの@autoclosure(escaping)形式を含めて ― 自動クロージャ節に加えた。

source: Added information about the availability attribute to the Declaration Attributes section.
ja: availability属性についての情報を宣言属性節に加えました。

source: Added information about the canImport() and targetEnvironment() platform conditions to Conditional Compilation Block.
ja: canImport()およびtargetEnvironment()プラットホーム条件についての情報を条件コンパイルブロックに加えた。

source: Added information about the dynamic declaration modifier in Declaration Modifiers.
ja: 宣言修飾子においてdynamic宣言修飾子についての情報を加えました。

source: Added information about the open and fileprivate access-level modifiers to the Access Control chapter.
ja: openおよびfileprivateアクセス水準修飾子についての情報をアクセス制御の章に加えた。

source: Added information about the requires_stored_property_inits and warn_unqualified_access attributes to the Declaration Attributes section.
ja: requires_stored_property_initsとwarn_unqualified_access属性についての情報を属性宣言の節に加えた。

source: Added information about the unowned, unowned(safe), and unowned(unsafe) declaration modifiers in the Declaration Modifiers section.
ja: unowned、unowned(safe)、そしてunowned(unsafe)宣言修飾子についての情報を宣言修飾子の節に加えた。

source: Added information about the behavior of enumeration cases with String raw values to the Implicitly Assigned Raw Values section of the Enumerations chapter and the Enumerations with Cases of a Raw-Value Type section of the Declarations chapter.
ja: Stringの生の値を持つ列挙ケース節の挙動についての情報を暗黙的に割り当てられる生の値節に列挙章でそして「生の値」型のケース節を持つ列挙節に宣言章で追加した。

source: Added information about the behavior of in-out parameters to the In-Out Parameters section.
ja: in-outパラメータの挙動についての情報をin-outパラメータ節に加えた。

source: Added information about the identity key path (\.self) to the Key-Path Expression section.
ja: 同一性キーパス（\.self）についての情報をキーパス式の節に加えた。

source: Added information about the new guard statement to the Early Exit section of the Control Flow chapter and the Guard Statement section of the Statements chapter.
ja: 新しいguard文についての情報を節早期退出に章制御の流れで、そして節guard文に章文で追加した。

source: Added information about the new try? keyword to the Converting Errors to Optional Values section.
ja: 新しいtry?キーワードについての情報をエラーをオプショナルの値に変換する節に加えた。

source: Added information about the new Swift standard library print(_:separator:terminator) function to the Printing Constants and Variables section.
ja: 新しいスウィフト標準ライブラリprint(_:separator:terminator)関数についての情報を定数と変数を出力する節に加えた。

source: Added information about the new optional pattern to the Optional Pattern section of the Patterns chapter.
ja: 新しいオプショナルパターンについての情報を節オプショナルパターンに章パターンで追加した。

source: Added information about throwing an error inside the catch block of a rethrowing function to the Rethrowing Functions and Methods section.
ja: 再スロー関数のcatchブロック内部でエラーをスローすることについての情報を、節再スローを行う関数とメソッドに加えた。

source: Added information about using enumeration cases as functions to the Enumerations with Cases of Any Type section.
ja: 列挙ケース節を関数として使うことについての情報を随意の型のケース節をもつ列挙節に加えた。

source: Added information about using keywords as external parameter names to the Keywords and Punctuation section.
ja: キーワードを外部パラメータ名として使うことについての情報をキーワードと句読点節に加えた。

source: Added information about using subscripts on types to the Type Subscripts section.
ja: 型の上で添え字を使うことについての情報を型添え字の節に加えました。

source: Added information about using the less than (<) operator in platform conditions to the Conditional Compilation Block section.
ja: より小さい（<）演算子をプラットホーム条件において使うことについての情報を条件コンパイルブロックの節に加えた。

source: Added information enumerations and structures that are frozen for library evolution to the frozen section.
ja: ライブラリ進化に対して凍結される列挙と構造体の情報をfrozenの節に加えました。

source: Added information to the Capture Lists section about how values specified in closure capture lists are captured.
ja: どのようにクロージャキャプチャリストにおいて指定された値がキャプチャされるかについて情報をキャプチャリスト節に加えた。

source: Added information to the Declaration Attributes section about using the available attribute with a Swift language version.
ja: 宣言属性節に、スウィフト言語版でのavailable属性を使うことについて情報を加えた。

source: Added information to the Metatype Type section about comparing metatype values and using them to construct instances with initializer expressions.
ja: メタタイプ型節に、メタタイプ値の比較と、それらをインスタンスを作り上げるためにイニシャライザ式とともに使う事についての情報を加えた。

source: Added information to the Overriding a Failable Initializer section about how a nonfailable initializer can delegate up to a failable initializer by force-unwrapping the result of the superclass’s initializer.
ja: 失敗できるイニシャライザのオーバーライド節に失敗できないイニシャライザが失敗できるイニシャライザにまで委任することを、スーパークラスのイニシャライザの結果を強制アンラップすることでできる方法についての情報を加えた。

source: Added information to the String Literals section about how concatenating string literals using the + operator happens at compile time.
ja: 文字列リテラル節に、どのように+演算子を使った文字列リテラルの連結がコンパイル時に起こるかについての情報を加えた。

source: Added information to the Type Alias Declaration section about generic type aliases and using type aliases inside of protocols.
ja: 情報を型エイリアス宣言の節に加えた、プロトコルの内部での総称体型エイリアスと型エイリアス利用について。

source: Added more information about curried functions.
ja: カリー化関数についての更なる情報を加えました。

source: Added similar information about the do statement in the Do Statement section.
ja: do文について同様の情報をdo文の節において追加した。

source: Added the Associated Types with a Generic Where Clause section, now that you can use generic where clauses to constrain associated types.
ja: 総称体where節を持つ関連型の節を加えた、今ではあなたは総称体where節を使って関連型を制約できます。

source: Added the Escaping Closures section with information about the @noescape attribute.
ja: 脱出クロージャの節を@noescape属性についての情報とともに加えた。

source: Added the Extended String Delimiters section and updated the String Literals section with information about extended string delimiters.
ja: 拡張文字列区切り記号の節を加えて文字列リテラルの節を拡張文字列区切り記号についての情報で更新した。

source: Added the Extensions with a Generic Where Clause section with information about extensions that include requirements.
ja: 総称体where節を持つ拡張の節を、要件を含む拡張についての情報とともに加えた。

source: Added the Functions With an Implicit Return and Shorthand Getter Declaration sections with information about functions that omit return.
ja: 暗黙的returnを持つ関数と 略記ゲッター宣言の節をreturnを省略する関数についての情報とともに加えました。

source: Added the Generic Subscripts section, now that subscripts can be generic.
ja: 総称体添え字の節を追加した、今では添え字は総称体にできます。

source: Added the Methods with Special Names section with information about syntactic sugar the lets instances of classes, structures, and enumerations be used with function call syntax.
ja: 特殊名を持つメソッドの節を、クラス、構造体、そして列挙のインスタンスが関数呼び出し構文で使われるようにする構文糖についての情報とともに加えた。

source: Added the dynamicCallable section with information about dynamically calling instances as functions using the dynamicCallable attribute.
ja: dynamicCallableの節を、動的にインスタンスを関数としてdynamicCallable属性を使って呼び出すことについての情報とともに加えた。

source: Added the unknown and Switching Over Future Enumeration Cases sections with information about handling future enumeration cases in switch statements using the unknown switch case attribute.
ja: unknownと未来列挙ケース節にわたってスイッチするの節をスイッチ文において未来列挙ケース節をunknownスイッチケース節属性を使って取り扱うことについての情報とともに加えた。

source: Adding Constraints to Protocol Extensions
ja: プロトコル拡張に制約を加える

source: Adding Constraints to an Associated Type
ja: 関連型に制約を加える

source: Adding Protocol Conformance with an Extension
ja: 拡張を使ってプロトコル準拠を加える

source: Adding protocol conformance in this way is described in Adding Protocol Conformance with an Extension.
ja: この方法でプロトコル準拠を加えることは拡張を使ってプロトコル準拠を加えるで記述されます。

source: Addition (+)
ja: 加算（+）

source: Additionally, although operators can contain an exclamation point (!), postfix operators can’t begin with either a question mark or an exclamation point.
ja: それに加えて、演算子は感嘆符（!）を含むことができますが、接尾辞演算子は、疑問符または感嘆符のどちらかで始まることはできません。

source: Additionally, when an instance is no longer needed, ARC frees up the memory used by that instance so that the memory can be used for other purposes instead.
ja: その上に、インスタンスがもはや必要でないとき、ARCはそのインスタンスによって使われるメモリを開放します、それでメモリが代わりに他の目的のために使われることができます。

source: Advanced Operators
ja: 先進の演算子

source: After a type alias is declared, the aliased name can be used instead of the existing type everywhere in your program.
ja: 型エイリアスが宣言されたあと、エイリアス（別名）にされた名前は、あなたのプログラムの至る所で既存の型の代わりに使われることができます。

source: After applying the provided closure to each array element, the map(_:) method returns a new array containing all of the new mapped values, in the same order as their corresponding values in the original array.
ja: 提供されたクロージャを各配列要素に適用した後に、map(_:)メソッドは、新しい対応付けられる値の全てを、もとの配列のそれらの対応する値と同じ順序で含んでいる新しい配列を返します。

source: After calling increment(forCount:), the optional Int that it returns is unwrapped into a constant called amount, using optional binding.
ja: increment(forCount:)呼び出しの後、それが返すオプショナルのIntは、オプショナル束縛を使って、amountと呼ばれる定数へとアンラップされます。

source: After calling super.init(), the original value of numberOfWheels is replaced with a new value of 2.
ja: super.init()の呼び出しの後、numberOfWheelsのもとの値は新しい値の2で置き換えられます。

source: After capturing these values, incrementer is returned by makeIncrementer as a closure that increments runningTotal by amount each time it is called.
ja: これらの値を捕獲した後に、incrementerはmakeIncrementerによって、それが呼ばれるたびにrunningTotalをamountによって増加させるクロージャとして返されます。

source: After creating the dictionary, this example uses subscript assignment to add a String key of "bird" and an Int value of 2 to the dictionary.
ja: 辞書を作成した後に、この例は、辞書にStringキーの"bird"とInt値の2を加えるために添え字代入を使います。

source: After declaring a new operator, you implement it by declaring a static method that has the same name as the operator.
ja: ある新しい演算子を宣言した後に、あなたはその演算子と同じ名前を持つ静的メソッドを宣言することによってそれを実装します。

source: After defining this extension, you can call the repetitions(task:) method on any integer to perform a task that many number of times:
ja: この拡張を定義した後、あなたはrepetitions(task:)メソッドをあらゆる整数上で呼び出して、ある作業をそれだけ多くの回数実行できます：

source: After defining this extension, you can use any Array as a Container.
ja: この拡張を定義した後に、あなたはどんなArrayでもContainerとして使うことができます。

source: After doing so, the initializer delegates up to the init(name: String) initializer of the Food class.
ja: そうした後に、イニシャライザは上ってFoodクラスのinit(name: String)イニシャライザに委任します。

source: After executing the code inside the switch case that matched, the program exits from the switch statement.
ja: 合致したスイッチのケース節（case）の内部のコードを実行した後に、プログラムはスイッチ文から出ます。

source: After making this check, the function iterates over all of the items in someContainer with a for-in loop and the half-open range operator (..<).
ja: この確認の後、関数はsomeContainerの項目の全てに渡ってfor-inループと半開範囲演算子（..<）を使って繰り返します。

source: After popping a value, the stack once again holds three values.
ja: 値をポップした後では、スタックは再び３つの値を持ちます。

source: After rolling the dice, the player moves forward by diceRoll squares.
ja: さいころを転がした後、プレーヤーは正方形をdiceRoll分だけ前進します。

source: After storing a small number like four, the value of someStructure.$someNumber is false.
ja: ４のような小さい値を格納後、someStructure.$someNumberの値はfalseです。

source: After the switch statement completes its execution, the example uses optional binding to determine whether a value was found.
ja: switch文がその実行を完了したあと、この例は値が見つけられたかどうか決定するためにオプショナル束縛を使います。

source: After the switch statement has finished executing, the number’s description is printed using the print(_:separator:terminator:) function.
ja: switch文が実行を終えたあと、その数の解説はprint(_:separator:terminator:)関数を使用して出力されます。

source: After the array is created, the name of the ShoppingListItem at the start of the array is changed from "[Unnamed]" to "Orange juice" and it is marked as having been purchased.
ja: 配列がつくられたあと、配列の始めのShoppingListItemの名前は、"[Unnamed]"から"Orange juice"へ変えられます、そしてそれは購入済みとして印されます。

source: After the code checks for snakes and ladders, the dice is rolled and the player is moved forward by diceRoll squares.
ja: コードがヘビとはしごについて調べた後、さいころが振られてプレーヤーはdiceRollだけの正方形を前進させられます。

source: After the code within a matched case has finished executing, the program exits from the switch statement.
ja: マッチされたケース節内のコードが実行を終えたあと、プログラムはswitch文から出ます。

source: After the first character, combining Unicode characters are also allowed.
ja: 最初の文字の後は、合成ユニコード文字もまた許されます。

source: After the first character, digits and combining Unicode characters are also allowed.
ja: 最初の文字の後は、桁および合成Unicode文字もまた、許されます。

source: After the statement is executed, the value of index is updated to contain the second value in the range (2), and the print(_:separator:terminator:) function is called again.
ja: 文が実行されたあと、indexの値は範囲の２番目の値（2）を含むように更新されます、そしてprint(_:separator:terminator:)関数が再び呼ばれます。

source: After the temporary constants are declared, they can be used within the case’s code block.
ja: 一時的な定数が宣言された後、それらはケース節のもつコードのかたまり内で使われることができます。

source: After this happens, there are no more strong references to the CreditCard instance, and it too is deallocated:
ja: これが起こったあと、CreditCardインスタンスへの強い参照はもうありません、そして、それも割り当て解除されます：

source: Again, the first three codeUnit values (68, 111, 103) represent the characters D, o, and g, whose UTF-16 code units have the same values as in the string’s UTF-8 representation (because these Unicode scalars represent ASCII characters).
ja: 再び、最初の３つのcodeUnit値（68、111、103）は文字D、o、そしてgを表します、これらのUTF-16符号単位はこの文字列のUTF-８叙述の場合と同じ値を持ちます（なぜなら、これらのユニコード・スカラーがASCII文字を表わすからです）。

source: All addition and subtraction for signed integers is performed in bitwise fashion, with the sign bit included as part of the numbers being added or subtracted, as described in Bitwise Left and Right Shift Operators.
ja: 符号つき整数に対する全ての加算と減算は、ビット単位の左および右シフト演算子で記述されるように、加算または減算される数の一部として含めらる符号ビットとともに、ビット単位流儀で実行されます。

source: All entities in your code (with a few specific exceptions, as described later in this chapter) have a default access level of internal if you don’t specify an explicit access level yourself.
ja: あなたのコードの中の全ての実在は（この章の後刻に記述されるように、２、３の特定の例外を除いて）、あなたが明示的に独自にアクセス水準を指定しないならば、省略時のアクセス水準である内部を持ちます。

source: All game logic is moved into the protocol’s play method, which uses the protocol’s required dice property to provide its dice roll values.
ja: 全てのゲーム論理は、プロトコルのplayメソッドに引っ越します、それは、プロトコルの要求するdiceプロパティを使ってそれのさいころ振りの値を提供します。

source: All information about the property—including its name, type, and memory management characteristics—is defined in a single location as part of the type’s definition.
ja: プロパティに関する全ての情報は ― その名前、型、そしてメモリ管理などの特徴を含めて ― その型の定義の一部として１つの場所で定義されます。

source: All is not lost, however.
ja: しかし、道がないわけではありません。

source: All of Swift’s basic types (such as String, Int, Double, and Bool) are hashable by default, and can be used as set value types or dictionary key types.
ja: スウィフトの基本の型の全て（String、Int、Double、そしてBoolなど）は、特に何もしなくてもハッシュ化されます、そして集合の値型または辞書のキー型として使われることができます。

source: All of Swift’s basic types (such as String, Int, Double, and Bool) are hashable by default.
ja: スウィフトの基本の型（例えばString、Int、Double、そしてBool）の全ては、初期状態でハッシュ化されます。

source: All of Swift’s standard types automatically support the Equatable protocol.
ja: スウィフトの標準の型の全ては、自動的にEquatableプロトコルをサポートします。

source: All of a class’s stored properties—including any properties the class inherits from its superclass—must be assigned an initial value during initialization.
ja: あるクラスの全ての格納プロパティは ― そのクラスがそれのスーパークラスから継承するあらゆるプロパティを含めて ― 初期化の間に初期値を代入される必要があります。

source: All of the functions you have encountered so far in this chapter have been examples of global functions, which are defined at a global scope.
ja: あなたがこの章においてこれまで遭遇した関数の全てはグローバルな関数の例でした、そしてそれは、グローバルなスコープで定義されます。

source: All of the game’s levels (apart from level one) are locked when the game is first played.
ja: ゲームが最初にプレイされるとき、ゲームのレベルの全ては鍵をかけられます（レベル１は別として）。

source: All of the other bits in firstBits and otherBits match and are set to 0 in the output value:
ja: firstBitsとotherBitsでの他の全てのビットは一致していて、出力値において0に設定されます：

source: All of the patterns of a compound case have to include the same set of value bindings, and each binding has to get a value of the same type from all of the patterns in the compound case.
ja: ある複合ケース節のパターンのすべては、同じひとそろいの値束縛を含まなければなりません、そしてそれぞれの束縛は同じ型の値をその複合ケース節のパターンのすべてから得なければなりません。

source: All of these floating-point literals have a decimal value of 12.1875:
ja: 以下の浮動小数点リテラルの全ては、10進の値で12.1875を持ちます：

source: All of these integer literals have a decimal value of 17:
ja: 次の整数リテラルの全ては、10進の値で17を持ちます：

source: All of these overflow operators begin with an ampersand (&).
ja: これらのオーバフロー演算子の全ては、アンパサンド（&）から始まります。

source: All of this information is rolled up into the function’s definition, which is prefixed with the func keyword.
ja: この情報の全ては、funcキーワードを前に置かれる、関数の定義にまとめ上げられます。

source: All of this means that you can create the Country and City instances in a single statement, without creating a strong reference cycle, and the capitalCity property can be accessed directly, without needing to use an exclamation point to unwrap its optional value:
ja: これの全ては、あなたがCountryとCityインスタンスを１つの文において、強い参照循環をつくることなく作成できることを意味します、そして、capitalCityプロパティはそのオプショナルの値をアンラップするために感嘆符を使う必要なしに直接にアクセスされることができます：

source: All options you can use with string interpolation are described in String Interpolation.
ja: あなたが文字列補間で使うことができるオプション全ては、「文字列補間」で記述されます。

source: All parameters must have unique names.
ja: すべてのパラメーターは、特有な名前を持たなければなりません。

source: All structures and enumerations are value types in Swift.
ja: 全ての構造体と列挙は、スウィフトでは値型です。

source: All structures have an automatically generated memberwise initializer, which you can use to initialize the member properties of new structure instances.
ja: 全ての構造体は自動的に生成されるメンバー関連イニシャライザを持ちます、それはあなたが新しい構造体インスタンスのメンバープロパティを初期化するために使うことが可能です。

source: All three of these initializers can be used to create new RecipeIngredient instances:
ja: これらのイニシャライザの３つ全てが、新しいRecipeIngredientインスタンスを作るために使用されることができます：

source: All tuple types contain two or more types, except for Void which is a type alias for the empty tuple type, ().
ja: すべてのタプル型は２つまたはそれ以上の型を含みます、しかし空のタプル型、()に対する型エイリアスであるVoidを除きます。

source: Also clarified the assignment and copy behavior for strings arrays and dictionaries.
ja: また「文字列、配列、および辞書のための代入およびコピーの挙動」がわかりやすくされました。

source: Alternative grammar productions are separated by vertical bars (|).
ja: 代替の文法導出は、垂直バー（|）で区別されます。

source: Alternatively, a type that conforms to SuffixableContainer can have a Suffix type that’s different from itself—meaning the suffix operation can return a different type.
ja: あるいはまた、SuffixableContainerに準拠する型は、それ自身とは異なるSuffix型を持つことができます—suffix演算は異なる型を返すことができることになります。

source: Alternatively, access a String value in one of three other Unicode-compliant representations:
ja: あるいは代わりに、３つの他のUnicode対応の表現の１つでString値にアクセスしてください：

source: Alternatively, access the individual element values in a tuple using index numbers starting at zero:
ja: あるいは、ゼロから始まっているインデックス番号を使ってタプルの個々の要素の値にアクセスしてください：

source: Alternatively, all items in a set can be removed with its removeAll() method.
ja: あるいはまた、集合の全ての項目はremoveAll()メソッドを使って取り除かれることができます。

source: Alternatively, append an array of one or more compatible items with the addition assignment operator (+=):
ja: あるいはまた、互換性を持つ１つ以上の項目からなる配列を、追加代入演算子（+=）を使って加えることができます：

source: Alternatively, enumeration cases can specify associated values of any type to be stored along with each different case value, much as unions or variants do in other languages.
ja: 代わりに、列挙ケース節は、ほとんど他の言語における共用体型やバリアント型がするように、それぞれ異なるケース節の値と一緒に格納されるために、あらゆる型の関連値を指定することが出来ます。

source: Alternatively, if the context already provides type information, such as a function argument or an already typed variable or constant, you can create an empty array with an empty array literal, which is written as [] (an empty pair of square brackets):
ja: 代わりに、前後関係がすでに型の情報を、例えば関数の引数またはすでに型指定された変数や定数などを提供するならば、あなたは空の配列を空の配列リテラル、[]（１対の空の角括弧）のように書かれるものでつくることができます：

source: Alternatively, if the context already provides type information, such as a function argument or an already typed variable or constant, you can create an empty set with an empty array literal:
ja: あるいはまた、関数の引数や既に型付けされた変数や定数のように、文脈がすでに型情報を提供するならば、あなたは空の集合を空の配列リテラルで作成することができます：

source: Alternatively, remove a key-value pair from a dictionary with the removeValue(forKey:) method.
ja: あるいは代わりに、removeValue(forKey:)メソッドで辞書から「キーと値」の対を削除してください。

source: Alternatively, specify a default property value as part of the property’s declaration.
ja: その代わりの方法として、省略時のプロパティ値をそのプロパティの宣言の一部として指定してください。

source: Alternatively, use the underscore character (_), also known as the wildcard pattern, to match any possible value.
ja: あるいはまた、起こりうるどんな値にもマッチするにはアンダースコア文字（_）、またワイルドカードパターンとして知られるもの、を使います。

source: Alternatively, you can create a stand-alone Character constant or variable from a single-character string literal by providing a Character type annotation:
ja: あるいは、あなたは１文字だけの文字列リテラルから単独のCharacter定数または変数を作成することが、Character型注釈を提供することによって可能です：

source: Alternatively, you can define a failable initializer that creates an implicitly unwrapped optional instance of the appropriate type.
ja: またはその代わりに、あなたは適切な型の暗黙的にアンラップされるオプショナルのインスタンスを作成する失敗できるイニシャライザを定義することができます。

source: Alternatively, you can mark an extension with an explicit access-level modifier (for example, private) to set a new default access level for all members defined within the extension.
ja: 代わりに、あなたは拡張に明確なアクセス水準修飾子（例えばprivate）で印して、新しい省略時のアクセス水準をその拡張内で定義される全てのメンバーに設定することができます。

source: Alternatively, you can override a superclass failable initializer with a subclass nonfailable initializer.
ja: または代わりに、あなたはスーパークラスの失敗できるイニシャライザをサブクラスの失敗できないイニシャライザでオーバーライドできます。

source: Although break is not required in Swift, you can use a break statement to match and ignore a particular case or to break out of a matched case before that case has completed its execution.
ja: breakはスウィフトでは必要とされないけれども、あなたはbreak文を特定のケース節を適合してから無視するために、または適合したケース節をそのケース節がそれの実行を完了してしまう前に抜け出すために使うことが出来ます。

source: Although both functions have names that begin with greet, the greet(person:alreadyGreeted:) function takes two arguments but the greet(person:) function takes only one.
ja: 両方の関数がgreetで始まる名前を持つとはいえ、greet(person:alreadyGreeted:)関数は２つの引数を取りますがgreet(person:)関数はただ１つだけ取ります。

source: Although conforming types don’t have to provide their own implementation of either, requirements with default implementations can be called without optional chaining.
ja: どちらにおいても準拠する型がそれ自身の実装を提供しなくても良いけれども、省略時の実装を持つ要件はオプショナル連鎖なしに呼ばれることができます。

source: Although either inlinable or usableFromInline can be applied to internal declarations, applying both attributes is an error.
ja: けれどもinlinableまたはusableFromInlineのどちらかは、internal宣言に適用できます、両方の属性を適用することはエラーです。

source: Although it’s common to define individual types in separate source files, a single source file can contain definitions for multiple types, functions, and so on.
ja: 通常は個々の型を別々のソースファイルに定義しますが、単一のソースファイルは、複数の型、関数、その他の定義を含むことが可能です。

source: Although it’s not specified as part of the protocol, it’s assumed that this value will be a number from 0.0 up to (but not including) 1.0.
ja: それはプロトコルの一部として指定されないけれども、この値は0.0から1.0まで（しかし含めてではない）のある数であるのを仮定されます。

source: Although it’s possible for multiple parameters to have the same argument label, unique argument labels help make your code more readable.
ja: 複数のパラメータが同じ引数ラベルを持つことは可能であるとは言え、特有な引数ラベルはあなたのコードをより読みやすくする助けとなります。

source: Although properties and methods declared in the superclass are inherited by the current class, designated initializers declared in the superclass are only inherited when the subclass meets the conditions described in Automatic Initializer Inheritance.
ja: スーパークラスの中で宣言されるプロパティやメソッドは現在のクラスによって継承されるけれども、スーパークラスの中で宣言される指定イニシャライザはただサブクラスが自動的なイニシャライザ継承で記述される条件と出会う場合に継承されるだけです。

source: Although technically allowed, this wouldn’t make for a very good data source.
ja: 技術的には可能であるけれども、これはあまり良いデータ・ソースにつながりません。

source: Although the method name and the property name are expressions, they’re never evaluated.
ja: method name（メソッド名）とproperty name（プロパティ名）は式であるけれども、それらは決して評価されません。
